blog/20.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 2.3.4 Example: Huffman Encoding Trees
#+subtitle: 2023-08-16 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)

Suppose we are in the business of encoding messages using bits. To do
that we need a way to associate a certain number of bits to each
symbol that belongs to our language. In /fixed-length/ codes all
symbols have the same number of bits. If we had $n$ symbols, then we
would need $\log_{2}n$ bits per symbol. So, if we wanted to
distinguish, say, the eight symbols A, B, C, D, E, F, G, H, then we
would need $\log_{2}8$ bits per symbols, that is, 3 bits per symbol
($2^{3} = 8$). For example:

|   A |   B |   C |   D |   E |   F |   G |   H |
|-----+-----+-----+-----+-----+-----+-----+-----|
| 000 | 001 | 010 | 011 | 100 | 101 | 110 | 111 |
|-----+-----+-----+-----+-----+-----+-----+-----|

The message `BACADAEAFABBAAAGAH' would then be encoded as the string
of 54 bits `001000010000011000100000101000001001000000000110000111'.
The ASCII code is an example of a fixed-length code.

/Variable-length/ codes, instead, do not assign the same number of
bits to all symbols. They assign shorter codes to frequent
symbols. This allows for considerable savings. The Morse code is an
example of a variable-length code.

With the following variable-length code

| A |   B |    C |    D |    E |    F |    G |    H |
|---+-----+------+------+------+------+------+------|
| 0 | 100 | 1010 | 1011 | 1100 | 1101 | 1110 | 1111 |
|---+-----+------+------+------+------+------+------|

We would encode the same message above in 42 bits.

However, we need a way to know when the end of a symbol is
reached. One technique, used by in the Morse code, is using
separators. Another solution consists in designing the code ``in such
a way that no complete code for any symbol is the beginning (or
/prefix/) of the code for another symbol. Such a code is called a
/prefix code/''.

One particular ``scheme'' for attaining savings by taking advantage of
relative frequencies is called the /Huffman encoding method/. A
Huffman code can be represented as a binary tree. The leaves hold the
encoded symbols pluse a weight (whose usage we shall see). Each
non-leaf node holds the set of all the symbols below it and the sum of
their weights.

#+begin_src
    *Figure 2.18:* A Huffman encoding tree.
    (From SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007))

                    {A B C D E F G H} 17
                             ,*
                            / \
                           /   \
                         A 8    * {B C D E F G H} 9
                     __________/ \_____________
                    /                          \
         {B C D} 5 *                            * {E F G H} 4
                  / \                       ___/ \___
                 /   \                     /         \
               B 3    * {C D} 2   {E F} 2 *           * {G H} 2
                     / \                 / \         / \
                    /   \               /   \       /   \
                  C 1   D 1           E 1   F 1   G 1   H 1
#+end_src

To encode: start at the root, and move down until your reach a
leaf. If you go left add a 0, otherwise add a 1.

To decode: start at the root and use the 0s and 1s to decide whether
to go; left or right.
* Generating Huffman trees
#+begin_src
Initial leaves {(A 8) (B 3) (C 1) (D 1) (E 1) (F 1) (G 1) (H 1)}
Merge          {(A 8) (B 3) ({C D} 2) (E 1) (F 1) (G 1) (H 1)}
Merge          {(A 8) (B 3) ({C D} 2) ({E F} 2) (G 1) (H 1)}
Merge          {(A 8) (B 3) ({C D} 2) ({E F} 2) ({G H} 2)}
Merge          {(A 8) (B 3) ({C D} 2) ({E F G H} 4)}
Merge          {(A 8) ({B C D} 5) ({E F G H} 4)}
Merge          {(A 8) ({B C D E F G H} 9)}
Final merge    {({A B C D E F G H} 17)}
#+end_src

* Representing Huffman trees
#+begin_src scheme
  ;; Leaf constructor
  (define (make-leaf symbol weight)
    (list 'leaf symbol weight))

  (define (leaf? object)
    (eq? (car object) 'leaf))

  ;; Leaf selectors:
  (define (symbol-leaf x) (cadr x))

  (define (weight-leaf x) (caddr x))

  ;; Tree constructor:
  (define (make-code-tree left right)
    (list left
          right
          (append (symbols left) (symbols right))
          (+ (weight left) (weight right))))

  ;; Tree selectors:
  (define (left-branch tree) (car tree))

  (define (right-branch tree) (cadr tree))

  (define (symbols tree)
    (if (leaf? tree)
        (list (symbol-leaf tree))
        (caddr tree)))

  (define (weight tree)
    (if (leaf? tree)
        (weight-leaf tree)
        (cadddr tree)))
#+end_src

* The decoding procedure
#+begin_src scheme
  (define (decode bits tree)
    (define (decode-1 bits current-branch)
      (if (null? bits)
          '()
          (let ((next-branch
                 (choose-branch (car bits) current-branch)))
            (if (leaf? next-branch)
                (cons (symbol-leaf next-branch)
                      (decode-1 (cdr bits) tree))
                (decode-1 (cdr bits) next-branch)))))
    (decode-1 bits tree))

  (define (choose-branch bit branch)
    (cond ((= bit 0) (left-branch branch))
          ((= bit 1) (right-branch branch))
          (else (error "bad bit -- CHOOSE-BRANCH" bit))))
#+end_src
