blog/20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-16 Wed 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 2.3.4 Example: Huffman Encoding Trees</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 2.3.4 Example: Huffman Encoding Trees
<br />
<span class="subtitle">2023-08-16 Wed</span>
</h1>
<p>
Suppose we are in the business of encoding messages using bits. To do
that we need a way to associate a certain number of bits to each
symbol that belongs to our language. In <i>fixed-length</i> codes all
symbols have the same number of bits. If we had \(n\) symbols, then we
would need \(\log_{2}n\) bits per symbol. So, if we wanted to
distinguish, say, the eight symbols A, B, C, D, E, F, G, H, then we
would need \(\log_{2}8\) bits per symbols, that is, 3 bits per symbol
(\(2^{3} = 8\)). For example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">A</th>
<th scope="col" class="org-right">B</th>
<th scope="col" class="org-right">C</th>
<th scope="col" class="org-right">D</th>
<th scope="col" class="org-right">E</th>
<th scope="col" class="org-right">F</th>
<th scope="col" class="org-right">G</th>
<th scope="col" class="org-right">H</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">000</td>
<td class="org-right">001</td>
<td class="org-right">010</td>
<td class="org-right">011</td>
<td class="org-right">100</td>
<td class="org-right">101</td>
<td class="org-right">110</td>
<td class="org-right">111</td>
</tr>
</tbody>
</table>

<p>
The message `BACADAEAFABBAAAGAH' would then be encoded as the string
of 54 bits `001000010000011000100000101000001001000000000110000111'.
The ASCII code is an example of a fixed-length code.
</p>

<p>
<i>Variable-length</i> codes, instead, do not assign the same number of
bits to all symbols. They assign shorter codes to frequent
symbols. This allows for considerable savings. The Morse code is an
example of a variable-length code.
</p>

<p>
With the following variable-length code
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">A</th>
<th scope="col" class="org-right">B</th>
<th scope="col" class="org-right">C</th>
<th scope="col" class="org-right">D</th>
<th scope="col" class="org-right">E</th>
<th scope="col" class="org-right">F</th>
<th scope="col" class="org-right">G</th>
<th scope="col" class="org-right">H</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">100</td>
<td class="org-right">1010</td>
<td class="org-right">1011</td>
<td class="org-right">1100</td>
<td class="org-right">1101</td>
<td class="org-right">1110</td>
<td class="org-right">1111</td>
</tr>
</tbody>
</table>

<p>
We would encode the same message above in 42 bits.
</p>

<p>
However, we need a way to know when the end of a symbol is
reached. One technique, used by in the Morse code, is using
separators. Another solution consists in designing the code ``in such
a way that no complete code for any symbol is the beginning (or
<i>prefix</i>) of the code for another symbol. Such a code is called a
<i>prefix code</i>''.
</p>

<p>
One particular ``scheme'' for attaining savings by taking advantage of
relative frequencies is called the <i>Huffman encoding method</i>. A
Huffman code can be represented as a binary tree. The leaves hold the
encoded symbols pluse a weight (whose usage we shall see). Each
non-leaf node holds the set of all the symbols below it and the sum of
their weights.
</p>

<pre class="example">
*Figure 2.18:* A Huffman encoding tree.
(From SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007))

                {A B C D E F G H} 17
                         *
                        / \
                       /   \
                     A 8    * {B C D E F G H} 9
                 __________/ \_____________
                /                          \
     {B C D} 5 *                            * {E F G H} 4
              / \                       ___/ \___
             /   \                     /         \
           B 3    * {C D} 2   {E F} 2 *           * {G H} 2
                 / \                 / \         / \
                /   \               /   \       /   \
              C 1   D 1           E 1   F 1   G 1   H 1
</pre>

<p>
To encode: start at the root, and move down until your reach a
leaf. If you go left add a 0, otherwise add a 1.
</p>

<p>
To decode: start at the root and use the 0s and 1s to decide whether
to go; left or right.
</p>
<div id="outline-container-org60ec80a" class="outline-2">
<h2 id="org60ec80a">Generating Huffman trees</h2>
<div class="outline-text-2" id="text-org60ec80a">
<pre class="example">
Initial leaves {(A 8) (B 3) (C 1) (D 1) (E 1) (F 1) (G 1) (H 1)}
Merge          {(A 8) (B 3) ({C D} 2) (E 1) (F 1) (G 1) (H 1)}
Merge          {(A 8) (B 3) ({C D} 2) ({E F} 2) (G 1) (H 1)}
Merge          {(A 8) (B 3) ({C D} 2) ({E F} 2) ({G H} 2)}
Merge          {(A 8) (B 3) ({C D} 2) ({E F G H} 4)}
Merge          {(A 8) ({B C D} 5) ({E F G H} 4)}
Merge          {(A 8) ({B C D E F G H} 9)}
Final merge    {({A B C D E F G H} 17)}
</pre>
</div>
</div>

<div id="outline-container-orgc323618" class="outline-2">
<h2 id="orgc323618">Representing Huffman trees</h2>
<div class="outline-text-2" id="text-orgc323618">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Leaf constructor</span>
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">make-leaf</span> symbol weight)
  (list 'leaf symbol weight))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">leaf?</span> object)
  (eq? (car object) 'leaf))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Leaf selectors:</span>
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">symbol-leaf</span> x) (cadr x))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">weight-leaf</span> x) (caddr x))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Tree constructor:</span>
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">make-code-tree</span> left right)
  (list left
        right
        (append (symbols left) (symbols right))
        (+ (weight left) (weight right))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Tree selectors:</span>
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">left-branch</span> tree) (car tree))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">right-branch</span> tree) (cadr tree))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">symbols</span> tree)
  (<span style="color: #b9ca4a;">if</span> (leaf? tree)
      (list (symbol-leaf tree))
      (caddr tree)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">weight</span> tree)
  (<span style="color: #b9ca4a;">if</span> (leaf? tree)
      (weight-leaf tree)
      (cadddr tree)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e7399c" class="outline-2">
<h2 id="org5e7399c">The decoding procedure</h2>
<div class="outline-text-2" id="text-org5e7399c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">decode</span> bits tree)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">decode-1</span> bits current-branch)
    (<span style="color: #b9ca4a;">if</span> (null? bits)
        '()
        (<span style="color: #b9ca4a;">let</span> ((next-branch
               (choose-branch (car bits) current-branch)))
          (<span style="color: #b9ca4a;">if</span> (leaf? next-branch)
              (cons (symbol-leaf next-branch)
                    (decode-1 (cdr bits) tree))
              (decode-1 (cdr bits) next-branch)))))
  (decode-1 bits tree))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">choose-branch</span> bit branch)
  (<span style="color: #b9ca4a;">cond</span> ((= bit 0) (left-branch branch))
        ((= bit 1) (right-branch branch))
        (<span style="color: #b9ca4a;">else</span> (error <span style="color: #70c0b1;">"bad bit -- CHOOSE-BRANCH"</span> bit))))
</pre>
</div>
</div>
</div>
