blog/20.org
* Sets of weighted elements
#+begin_src scheme
  (define (adjoin-set x set)
    (cond ((null? set) (list x))
          ((< (weight x) (weight (car set))) (cons x set))
          (else (cons (car set)
                      (adjoin-set x (cdr set))))))

  (define (make-leaf-set pairs)
    (if (null? pairs)
        '()
        (let ((pair (car pairs)))
          (adjoin-set (make-leaf (car pair)    ; symbol
                                 (cadr pair))  ; frequency
                      (make-leaf-set (cdr pairs))))))
#+end_src

* Exercise 2.67
*Exercise*:

#+begin_quote
Define an encoding tree and a sample message:

#+begin_src scheme
  (define sample-tree
    (make-code-tree
     (make-leaf 'A 4)
     (make-code-tree
      (make-leaf 'B 2)
      (make-code-tree
       (make-leaf 'D 1)
       (make-leaf 'C 1)))))

  (define sample-message
    '(0 1 1 0 0 1 0 1 0 1 1 1 0))
#+end_src

Use the ~decode~ procedure to decode the message, and give the result.
#+end_quote

*Answer*:

#+begin_src scheme
  (decode sample-message sample-tree) ;; (A D A B B C A)
#+end_src

* Exercise 2.68
*Exercise*:

#+begin_quote
The ~encode~ procedure takes as arguments a message and a tree and
produces the list of bits that gives the encoded message.

#+begin_src scheme
  (define (encode message tree)
    (if (null? message)
        '()
        (append
         (encode-symbol (car message)
                        tree)
         (encode (cdr message) tree))))
#+end_src

~Encode-symbol~ is a procedure, which you must write, that returns the
list of bits that encodes a given symbol according to a given
tree. You should design ~encode-symbol~ so that it signals an error if
the symbol is not in the tree at all. Test your procedure by encoding
the result you obtained in Exercise 2.67 with the sample tree and
seeing whether it is the same as the original sample message.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (element-of-set? x set)
    (cond ((null? set) false)
          ((equal? x (car set)) true)
          (else (element-of-set? x (cdr set)))))

  (define (encode-symbol sym tree)
    (cond ((element-of-set? sym (symbols tree))
           (if (element-of-set? sym (symbols (left-branch tree)))
               (if (leaf? (left-branch tree))
                   '(0)
                   (cons 0 (encode-symbol sym (left-branch tree))))
               (if (leaf? (right-branch tree))
                   '(1)
                   (cons 1 (encode-symbol sym (right-branch tree))))))
          (else (error "Cannot encode symbol :( Symbol is not in the tree"))))
#+end_src

- Comments:
  - The check for error could be done just once.
  - Simplify the conditions?

* Exercise 2.69
*Exercise*:
#+begin_quote
The following procedure takes as its argument a list of
symbol-frequency pairs (where no symbol appears in more than one pair)
and generates a Huffman encoding tree according to the Huffman
algorithm.

#+begin_src scheme
  (define (generate-huffman-tree pairs)
    (successive-merge (make-leaf-set pairs)))
#+end_src

~Make-leaf-set~ is the procedure given above that transforms the list
of pairs into an ordered set of leaves.  ~Successive-merge~ is the
procedure you must write, using ~make-code-tree~ to successively merge
the smallest-weight elements of the set until there is only one
element left, which is the desired Huffman tree.  (This procedure is
slightly tricky, but not really complicated.  If you find yourself
designing a complex procedure, then you are almost certainly doing
something wrong.  You can take significant advantage of the fact that
we are using an ordered set representation.)
#+end_quote

*Answer*:

#+begin_src scheme
  (define (successive-merge pairs)
    (cond ((null? pairs) nil)
          ((null? (cdr pairs)) (car pairs))
          (else (successive-merge
                 (adjoin-set (make-code-tree (car pairs) (cadr pairs))
                             (cddr pairs))))))
#+end_src

* Exercise 2.70
#+begin_quote
The following eight-symbol alphabet with associated relative
frequencies was designed to efficiently encode the lyrics of 1950s
rock songs. (Note that the “symbols” of an “alphabet” need not be
individual letters.)

#+begin_src
A    2    NA  16
BOOM 1    SHA  3
GET  2    YIP  9
JOB  2    WAH  1
#+end_src

Use ~generate-huffman-tree~ (Exercise 2.69) to generate a
corresponding Huffman tree, and use ~encode~ (Exercise 2.68) to encode
the following message:

#+begin_src
Get a job
Sha na na na na na na na na

Get a job
Sha na na na na na na na na

Wah yip yip yip yip
yip yip yip yip yip
Sha boom
#+end_src

How many bits are required for the encoding? What is the smallest
number of bits that would be needed to encode this song if we used a
fixed-length code for the eight-symbol alphabet?
#+end_quote

*Answer*:

#+begin_src scheme
  (define rock-tree
    (generate-huffman-tree
     '((A 2) (NA 16) (BOOM 1) (SHA 3) (GET 2) (YIP 9) (JOB 2) (WAH 1))))

  (encode '(GET A JOB
                SHA NA NA NA NA NA NA NA NA

                GET A JOB
                SHA NA NA NA NA NA NA NA NA

                WAH YIP YIP YIP YIP
                YIP YIP YIP YIP YIP
                SHA BOOM)
          rock-tree)
  ;; => (1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 1 1 0 1 1 0 1 1)

#+end_src

84 bits are required.

If we used a fixed-length code, given that we have 8 symbols, we would
need 3 bits for each symbol (Cf. p.161). The song is made of 36
symbols, so to encode it with a fixed-length code we would need (*
36 3) = 108 bits.

