blog/20.html
<div id="outline-container-org827fcd0" class="outline-2">
<h2 id="org827fcd0">Sets of weighted elements</h2>
<div class="outline-text-2" id="text-org827fcd0">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-set</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) (list x))
        ((&lt; (weight x) (weight (car set))) (cons x set))
        (<span style="color: #b9ca4a;">else</span> (cons (car set)
                    (adjoin-set x (cdr set))))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">make-leaf-set</span> pairs)
  (<span style="color: #b9ca4a;">if</span> (null? pairs)
      '()
      (<span style="color: #b9ca4a;">let</span> ((pair (car pairs)))
        (adjoin-set (make-leaf (car pair)    <span style="color: #969896; font-style: italic;">; </span><span style="color: #969896; font-style: italic;">symbol</span>
                               (cadr pair))  <span style="color: #969896; font-style: italic;">; </span><span style="color: #969896; font-style: italic;">frequency</span>
                    (make-leaf-set (cdr pairs))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc349eda" class="outline-2">
<h2 id="orgc349eda">Exercise 2.67</h2>
<div class="outline-text-2" id="text-orgc349eda">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Define an encoding tree and a sample message:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> <span style="color: #e78c45;">sample-tree</span>
  (make-code-tree
   (make-leaf 'A 4)
   (make-code-tree
    (make-leaf 'B 2)
    (make-code-tree
     (make-leaf 'D 1)
     (make-leaf 'C 1)))))

(<span style="color: #b9ca4a;">define</span> <span style="color: #e78c45;">sample-message</span>
  '(0 1 1 0 0 1 0 1 0 1 1 1 0))
</pre>
</div>

<p>
Use the <code>decode</code> procedure to decode the message, and give the result.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(decode sample-message sample-tree) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(A D A B B C A)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fc9fa5" class="outline-2">
<h2 id="org0fc9fa5">Exercise 2.68</h2>
<div class="outline-text-2" id="text-org0fc9fa5">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The <code>encode</code> procedure takes as arguments a message and a tree and
produces the list of bits that gives the encoded message.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">encode</span> message tree)
  (<span style="color: #b9ca4a;">if</span> (null? message)
      '()
      (append
       (encode-symbol (car message)
                      tree)
       (encode (cdr message) tree))))
</pre>
</div>

<p>
<code>Encode-symbol</code> is a procedure, which you must write, that returns the
list of bits that encodes a given symbol according to a given
tree. You should design <code>encode-symbol</code> so that it signals an error if
the symbol is not in the tree at all. Test your procedure by encoding
the result you obtained in Exercise 2.67 with the sample tree and
seeing whether it is the same as the original sample message.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">element-of-set?</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) false)
        ((equal? x (car set)) true)
        (<span style="color: #b9ca4a;">else</span> (element-of-set? x (cdr set)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">encode-symbol</span> sym tree)
  (<span style="color: #b9ca4a;">cond</span> ((element-of-set? sym (symbols tree))
         (<span style="color: #b9ca4a;">if</span> (element-of-set? sym (symbols (left-branch tree)))
             (<span style="color: #b9ca4a;">if</span> (leaf? (left-branch tree))
                 '(0)
                 (cons 0 (encode-symbol sym (left-branch tree))))
             (<span style="color: #b9ca4a;">if</span> (leaf? (right-branch tree))
                 '(1)
                 (cons 1 (encode-symbol sym (right-branch tree))))))
        (<span style="color: #b9ca4a;">else</span> (error <span style="color: #70c0b1;">"Cannot encode symbol :( Symbol is not in the tree"</span>))))
</pre>
</div>

<ul class="org-ul">
<li>Comments:
<ul class="org-ul">
<li>The check for error could be done just once.</li>
<li>Simplify the conditions?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org410ac9d" class="outline-2">
<h2 id="org410ac9d">Exercise 2.69</h2>
<div class="outline-text-2" id="text-org410ac9d">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
The following procedure takes as its argument a list of
symbol-frequency pairs (where no symbol appears in more than one pair)
and generates a Huffman encoding tree according to the Huffman
algorithm.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">generate-huffman-tree</span> pairs)
  (successive-merge (make-leaf-set pairs)))
</pre>
</div>

<p>
<code>Make-leaf-set</code> is the procedure given above that transforms the list
of pairs into an ordered set of leaves.  <code>Successive-merge</code> is the
procedure you must write, using <code>make-code-tree</code> to successively merge
the smallest-weight elements of the set until there is only one
element left, which is the desired Huffman tree.  (This procedure is
slightly tricky, but not really complicated.  If you find yourself
designing a complex procedure, then you are almost certainly doing
something wrong.  You can take significant advantage of the fact that
we are using an ordered set representation.)
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">successive-merge</span> pairs)
  (<span style="color: #b9ca4a;">cond</span> ((null? pairs) nil)
        ((null? (cdr pairs)) (car pairs))
        (<span style="color: #b9ca4a;">else</span> (successive-merge
               (adjoin-set (make-code-tree (car pairs) (cadr pairs))
                           (cddr pairs))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfaf01ad" class="outline-2">
<h2 id="orgfaf01ad">Exercise 2.70</h2>
<div class="outline-text-2" id="text-orgfaf01ad">
<blockquote>
<p>
The following eight-symbol alphabet with associated relative
frequencies was designed to efficiently encode the lyrics of 1950s
rock songs. (Note that the “symbols” of an “alphabet” need not be
individual letters.)
</p>

<pre class="example">
A    2    NA  16
BOOM 1    SHA  3
GET  2    YIP  9
JOB  2    WAH  1
</pre>

<p>
Use <code>generate-huffman-tree</code> (Exercise 2.69) to generate a
corresponding Huffman tree, and use <code>encode</code> (Exercise 2.68) to encode
the following message:
</p>

<pre class="example">
Get a job
Sha na na na na na na na na

Get a job
Sha na na na na na na na na

Wah yip yip yip yip
yip yip yip yip yip
Sha boom
</pre>

<p>
How many bits are required for the encoding? What is the smallest
number of bits that would be needed to encode this song if we used a
fixed-length code for the eight-symbol alphabet?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> <span style="color: #e78c45;">rock-tree</span>
  (generate-huffman-tree
   '((A 2) (NA 16) (BOOM 1) (SHA 3) (GET 2) (YIP 9) (JOB 2) (WAH 1))))

(encode '(GET A JOB
              SHA NA NA NA NA NA NA NA NA

              GET A JOB
              SHA NA NA NA NA NA NA NA NA

              WAH YIP YIP YIP YIP
              YIP YIP YIP YIP YIP
              SHA BOOM)
        rock-tree)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 1 1 0 1 1 0 1 1)</span>

</pre>
</div>

<p>
84 bits are required.
</p>

<p>
If we used a fixed-length code, given that we have 8 symbols, we would
need 3 bits for each symbol (Cf. p.161). The song is made of 36
symbols, so to encode it with a fixed-length code we would need (*
36 3) = 108 bits.
</p>
</div>
</div>
